Repository: MAYLOL/maylol-wallet-ios
Catalog: Trust/Localization/*.lproj/Localizable.strings
Languages: ja, vi

# import.watch.footer
source: You can “watch” any public address without divulging your private key. This let’s you view balances and transactions, but not send transactions.
ja: 「ウォッチ」では、秘密鍵を入力することなく任意のパブリックアドレスを閲覧することが出来ます。これは残高や取引履歴の確認のみ可能であり、送金等はできません。
vi: Bạn có thể "xem" bất kỳ địa chỉ công cộng nào mà không tiết lộ khóa riêng của mình. Điều này cho phép bạn xem số dư và giao dịch, nhưng không thể gửi giao dịch.

source: Network Fee
ja: ネットワーク手数料
vi: Chi phí cho mạng lưới

# send.error.insufficientEther
source: Insufficient %@ balance
ja: %@の残高不足
vi: Không đủ số dư %@

# send.error.insufficientGas
source: Insufficient %@ to cover gas fee
ja: ガス料金をカバーするには不十分な%@
vi: Không đủ %@ để trả phí gas

# send.error.insufficientToken
source: Insufficient %@ token balance
ja: %@のトークン残高不足
vi: Không đủ số dư %@ trong tài khoản

# settings.autoLock.button.title
source: Auto-Lock
ja: オートロック
vi: Tự động khóa

# wallets.navigation.title.autolock.five.hour
source: If away for 5 hours
ja: 5時間使用していない場合
vi: Nếu vắng mặt trong 5 tiếng

# wallets.navigation.title.autolock.five.minutes
source: If away for 5 minutes
ja: 5分間使用していない場合
vi: Nếu vắng mặt trong 5 phút

# wallets.navigation.title.autolock.immediate
source: Immediate
ja: 即時に
vi: Ngay lập tức

# wallets.navigation.title.autolock.one.hour
source: If away for 1 hour
ja: 1時間使用していない場合
vi: Nếu vắng mặt trong 1 tiếng

# wallets.navigation.title.autolock.one.minute
source: If away for 1 minute
ja: 1分間使用していない場合
vi: Nếu vắng mặt trong 1 phút

source: Watch
ja: ウォッチ
vi: Xem

source: Done
ja: 完了

source: Manage
ja: 管理

# passphrase.seed.label.title
source: These 12 words are the only way to restore your Trust wallet. Save them somewhere safe and secret.
ja: これらの12の言葉はあなたの Trust アカウントを復元する唯一の方法です。誰にも言わず安全に保存してください。

# settings.analitics.answer.description
source: Help Trust improve user experience by sharing app daily diagnostic.
ja: 診断情報を共有することで Trust のユーザエクスペリエンス向上を支援します。

# settings.analitics.branch.description
source: Help Trust improve user engagement by sharing deep links redirects.
ja: ディープリンクのリダイレクトを共有することで Trust のユーザエンゲージメント向上を支援します。

# settings.analitics.crashlytics.description
source: Help Trust developers to improve its product and service by automatically sending crash reports.
ja: 自動的にクラッシュ レポートを送信することにより、Trust 開発者が製品・サービスを改善することを支援します。

# settings.privacy.title
source: Privacy
ja: プライバシー

source: Skip
ja: スキップ

source: Verify Backup Phrase
ja: バックアップフレーズの確認

# verify.passphrase.invalidOrder.title
source: Invalid order. Try again!
ja: 順番が誤っています。もう一度やり直してください！

# verify.passphrase.welldone.title
source: Well done! %@
ja: 確認完了！%@

# verifyPassphrase.label.title
source: Tap the words to put them next to each other in the correct order.
ja: 正しい順番に並ぶように、単語を順番にタップしてください。

# verifyPassphrase.skip.confirm.message
source: Loss of backup phrase can put your wallet at risk!
ja: バックアップフレーズを紛失した場合、ウォレットを危険にさらすことになります！

# verifyPassphrase.skip.confirm.title
source: Are you sure you want to skip this step?
ja: 本当にこの手順をスキップしてよろしいですか？

# wallet.info.exportBackupPhrase
source: Show Backup Phrase
ja: バックアップフレーズを表示する。

source: Reload
ja: 再読み込み

source: Phrase
ja: フレーズ

source: Wallet
ja: ウォレット

source: My Wallet Address
ja: 私のウォレットアドレス

source: Wallet Created
ja: ウォレットが作成されました

source: Back
ja: 戻る

source: Main Wallet
ja: メインウォレット

source: Imported Wallets
ja: インポートウォレット

source: Backup Phrase
ja: バックアップ フレーズ

source: Address
ja: アドレス

source: Creating Wallet
ja: ウォレットを作成中

source: Wallet Imported
ja: ウォレットがインポートされました

source: Select Coin
ja: コインを選択

source: Import Main Wallet
ja: メインウォレットをインポート

source: Developer
ja: 開発者

source: Node Settings
ja: ノード設定

source: Test Networks
ja: テストネットワーク

source: Enable Test Networks
ja: テストネットワークを有効にする

source: Network
ja: ネットワーク

source: Multi-Coin Wallet
ja: マルチコインウォレット

source: Learn More
ja: さらに詳しく知る

# settings.helpCenter.title
source: Help Center
ja: ヘルプセンター

source: Daily Usage
ja: 毎日の利用状況

source: Deferred Deep Linking
ja: ディファードディープリンク

source: Crash Reports
ja: クラッシュレポート

# ML.Manager.tokens.noWallet
source: You still did not create a wallet.
ja: 現在、作成されたウォレットがありません

# ML.Manager.tokens.addWallet
source: Click to add or create a wallet.
ja: クリックの後、ウォレットを作成/追加

# ML.CreateWallet.button.title
source: Create wallet
ja: ウォレットを作成

# ML.ImportWallet.button.title
source: Import wallet
ja: ウォレットを開く

# ML.CreateWalletSettinglabelsubtitle
source: ·Passwords are used to protect private key transactions and transaction authorization. The intensity is very important. ·We do not store passwords, nor can we help you find them. Please bear in mind.
ja: ·パスワードは取引及び取引の授権の保護に使用されるのでパスワードの強度が大変重要です。 ·プラットフォームはお客様のパスワードを保存していないので、忘れた場合、プラットフォームからはお探しできないこと予めご了承ください。

# ML.CreateWalletSettingWalletName
source: Wallet name
ja: ウォレットの名称

# ML.Password
source: Password
ja: 暗証番号

# ML.Password.weak
source: Weak
ja: 約

# ML.Password.middle
source: Medium
ja: 中

# ML.Password.strong
source: Strong
ja: 強

# ML.CreateWalletRePassWord
source: Repeat password
ja: 暗証番号の再入力

# ML.CreateWalletSettingServicePrivacyClause
source: terms of Service Privacy.
ja: サービスプライバシーの条項

# ML.CreateWalletSettingServicePrivacyClause1
source: I have carefully read and agreed to the
ja: 私はよく読んで同意しました

# ML.AgreeAgreement.please
source: Please agree to the agreement.
ja: 規約の内容を確認してください

# ML.ImportWallet.atOnce
source: Import immediately
ja: 今すぐウォレットを開く

# ML.CreateWallet.Ing
source: Creating wallet
ja: ウォレットを作成中

# ML.CreateWallet.Success
source: Succeed
ja: ウォレットの作成完了

# ML.BackupWallet.Last
source: Last step: back up your wallet immediately.
ja: ラストステップ：私のウォレットをバックアップする

# ML.BackupWalletAndExport.Use
source: Back up your wallet: Export "mnemonics" and copy them to a safe place. Never save them in the network, and then try to transfer in and out of small amount of assets for use.
ja: ウォレットのバックアップ：「連想単語」キーを記録して安全な場所に保管してください。絶対オンライン上の保存はしないことを提案しており、所定の金額の送金テストを済ましてからご使用ください。

# ML.Export.backup.button.title
source: Back Up Wallet
ja: ウォレットをバックアップする

# ML.BackupWalletCourse.Look
source: View detailed instructions
ja: バックアップの詳細プロセスをみる

# ML.lock.enter.passcode.view.model.initial
source: Please input a password
ja: パスワードを入力

# ML.Cancel
source: Cancel
ja: 取り消し

# ML.Sure
source: OK
ja: 確認

# ML.Password.error
source: Password error
ja: パスワードのエラー

# ML.ScreenPrint.Not
source: Do not screenshot
ja: スクリーンショット禁止

# ML.ScreenPrint.Write
source: If someone gets your mnemonics, it will get your assets directly! Please write down the mnemonics and store them in a safe place.
ja: 連想単語のキーが盗まれるとあなたの資産が危険になります。必ず安全な場所に連想単語キーを記録して保管してください

# ML.ScreenPrint.yee
source: I got it!
ja: はい、分かりました

# ML.BackupPhrase
source: Back up mnemonics
ja: 連想単語キーのバックアップ

# ML.Write.Phrase
source: Copy down your wallet mnemonics
ja: 連想単語キーを記録する

# ML.Write.PhraseTips
source: Mnemonics are used to reply to a wallet or reset a wallet password, accurately copy it on paper and store it in a safe place that only you know.
ja: 連想単語キーはウォレットやウォレットのパスワードを再設定する時に必ず必要な情報であり、ぜひ手書きで記録した後、本人のみ確認のできる安全な場所に保管してください。

# ML.Next
source: Next step
ja: 次のステップ

# ML.BackupPhrase.Sure
source: Confirm your wallet mnemonics.
ja: 連想単語キーの確認

# ML.BackupPhrase.Touch
source: Please click the mnemonics in order to confirm that your backup mnemonics are correct.
ja: 順番に連想単語キーをクリックして正確な連想単語キーのバックアップを進めてください。

# ML.BackupPhrase.Error
source: The sequence of mnemonics is incorrect. Please check again.
ja: 連想単語キーの順番が間違っています。もう一度確認してください。

# ML.BackupPhrase.Success
source: Backup success
ja: バックアップ完了

# ML.Tokens.cell.Totalassets
source: Total assets
ja: 総資産

# ML.Token.ReceiptCode
source: Money receiving QR code
ja: 受領コード

# ML.Share
source: Sharing
ja: 共有

# ML.Token.copyAddress
source: Copy beneficiary address
ja: 受領アドレスをコピーする

# ML.Copy
source: Copy
ja: コピーする

# ML.Copy.Ready
source: Copied
ja: コピー完了

# ML.My.Wallet
source: My wallet
ja: 私のウォレット

# ML.Manager.UnnamedWallet
source: Unnamed Wallet
ja: 未定のウォレット

# ML.QrCode.button.title
source: Scan
ja: スキャンする

# ML.QrCode.Start
source: Please scan the bar code in the viewfinder.
ja: バーコードをスキャンする

# ML.Manager.Wallet
source: Manage the wallet
ja: ウォレットの管理

# ML.Settings.navigation.title
source: Set up
ja: 設定

# ML.Setting.multilingual
source: Multilingual
ja: 多国語

# ML.Setting.cell.MonetaryUnit
source: Monetary unit
ja: 貨幣単位

# ML.Setting.cell.Aboutus
source: About us
ja: 会社紹介

# ML.Setting.cell.Aboutus.UseProtocol
source: Protocol
ja: 使用契約

# ML.Setting.cell.Aboutus.PrivacyClause
source: Privacy Terms
ja: 個人情報ポリシー

# ML.Setting.cell.Aboutus.ProductGuide
source: Product Wizard
ja: 商品の紹介

# ML.Setting.cell.Aboutus.DetectionUpdate
source: Test Updates
ja: アップグレード

# ML.Setting.cell.Aboutus.Currentversion
source: Current Version
ja: 現在バージョン

# ML.Phrase
source: Mnemonics
ja: 連想単語キー

# ML.PhrasebySpaces
source: Mnemonics separated by spaces
ja: 連想単語キー / スペースの区分

# ML.PrivateKey
source: Private key
ja: プライベートキー

# ML.PrivateKey.Word
source: Express private key
ja: パブリックキー

# ML.PhraseIntroduce
source: What is a mnemonics?
ja: 連想単語キーとは？

# ML.PrivateIntroduce
source: What is a private key?
ja: プライベートキーとは？

# ML.Manager.Wallet.Title
source: Manage the wallet
ja: ウォレットを管理する

# ML.Manager.DeleteWallet.Title
source: Delete the wallet
ja: ウォレットを削除する

# ML.Manager.DeleteWallet.Success
source: Delete succeed
ja: 削除完了

# ML.BackupWallet.Please
source: Please back up
ja: バックアップしてください

# ML.BackupWallet.Ready
source: Backup completed
ja: バックアップ完了

# ML.Wallet.Name
source: Wallet name
ja: ウォレットの名称

# ML.Password.Change
source: Modify password
ja: パスワードの修正

# ML.Password.Current
source: Current password
ja: 現在のパスワード

# ML.Password.New
source: New password
ja: 新しいパスワード

# ML.Password.Repeat
source: Repeat new password
ja: 新しいパスワードを再入力

# ML.Finish
source: Completed
ja: 完成

# ML.Save
source: Save
ja: 保存

# ML.Export.PrivateKey
source: Export private key
ja: プライベートキーをインポート

# ML.Export.Warning
source: Security warning: private key is not encrypted, and exporting is risky. It is recommended to use mnemonics and private key for backup.
ja: 警告：プライベートキーのパスワード設定がされていないので、 漏洩の危機があります。必ず連想単語キーとプライベートキーを使用してバックアップしてください。

# ML.Export.Password.Change
source: You can reset the password by importing mnemonics or private key.
ja: 連想単語キーとプライベートキーを使ってパスワードを再設定します。

# ML.Transaction.Recentrecords
source: Recent transaction records
ja: 最近の取引履歴

# ML.Transaction.Packing.Wait
source: Waiting for packaging
ja: パッキング中

# ML.Transaction.Packing.Failure
source: Packaging failure
ja: パッキング失敗

# ML.Transaction.Packing.Success
source: Packaging completed
ja: パッキング完了

# ML.Transaction.Assets
source: Assets
ja: 資産

# ML.Transaction.Count
source: Quantity
ja: 数量

# ML.Transaction.Income
source: Today's income
ja: 今日の収益

# ML.Transaction.cell.tokenTransfer.title
source: Transfer
ja: 送金

# ML.Transaction.cell.receivables.title
source: Receive
ja: 受領

# ML.Transaction.cell.PayeeWalletAddress
source: Beneficiary’s wallet address
ja: 受領人のウォレットのアドレス

# ML.Transaction.cell.TransferAmount
source: Transfer amount
ja: 送金金額

# ML.Transaction.cell.Amountofmoney
source: Amount
ja: 金額

# ML.Transaction.cell.Remarks
source: Information
ja: 備考

# ML.Transaction.cell.MinerCost
source: Absenteeism cost
ja: 採掘費用

# ML.Transaction.cell.slow
source: Slow
ja: 遅い

# ML.Transaction.cell.fast
source: Fast
ja: 速い

# ML.Transaction.cell.Advancedoptions
source: Advanced option
ja: 高級オプション

# ML.Transaction.Next
source: Next
ja: 次

# ML.Transaction.cell.Pursecipher
source: Wallet password
ja: ウォレットのパスワード

# ML.Transaction.cell.Detailsofpayment
source: Payment details
ja: 支払いの詳細内容

# ML.Transaction.cell.Transfertotheaddress
source: Beneficiary’s address
ja: 送金アドレス

# ML.Transaction.cell.PaymentPurse
source: Payment wallet
ja: 支払いウォレット

# ML.Transaction.Unfinish
source: Operation failure
ja: 作業が完了されていません

# ML.Warning
source: Warning
ja: 警告

# ML.Transaction.sent.title
source: Sent
ja: 発送完了

# ML.Transaction.cell.CustomGasPrice
source: Custom Gas Price
ja: 使用者設定Gas Price

# ML.Transaction.cell.CustomGas
source: Custom Gas
ja: 用者設定Gas

# ML.Transaction.cell.Sixteenbinarydata
source: Hexadecimal data
ja: 16進法のデータ

# ML.Transaction.cell.HowToSetParameters
source: How to set parameters?
ja: パラメータの設定方法

# ML.Transaction.Info
source: Transaction Details
ja: 取引明細書

# ML.Transaction.sender
source: Sender
ja: 発送人

# ML.Transaction.ID
source: Transaction ID
ja: 取引ID

# ML.NetworkFee
source: Network Cost
ja: インターネット費用

# ML.Send.error.invalidAddress.Error
source: Invalid address
ja: アドレスエラー

# ML.Send.error.invalidAmount.Error
source: Invalid quantity
ja: 数量エラー

# ML.Password.NoMatch.Error
source: Password invalid
ja: パスワードの不一致

# ML.WalletName.NotEmpty.Error
source: Wallet name cannot be null!
ja: ウォレットの名称を確認してください。

# ML.Password.Notformat.Error
source: Please enter a password composed of 6-16 numbers and letters.
ja: 6-16桁の英数字の組み合わせのパスワードを入力してください。

# ML.Password.NotEqual.Error
source: Password is not the same!
ja: 同じパスワードではありません。

# ML.Password.Invalid.Error
source: Invalid password!
ja: パスワードエラーです。

# ML.Password.Empty.Error
source: The password cannot be null!
ja: パスワードを確認してください。

# ML.WalletName.Name.Error
source: Please enter a wallet name in 1-12 digits.
ja: 1-12桁のウォレットの名称を入力してください。

# ML.ReadProtocol.NotRead.Error
source: Please read the agreement and agree!
ja: 規約内容を読み、同意してください。

# ML.Phrase.InvalidError
source: Invalid mnemonics!
ja: 連想単語キーのエラー

# ML.Private.InvalidError
source: Invalid private key!
ja: プライベートキーのエラー

# ML.Private.Characters.Error
source: The private key must be 64-characters-long.
ja: プライベートキーは必ず64文字でなければなりません。

# ML.Gas.Low.Error
source: The Gas value should be greater than 21000.
ja: Gas価格は21,000より高くしなければなりません。

# ML.Gas.Height.Error
source: The Gas value should be less than 600000.
ja: Gas価格は600,000より低くしなければなりません。

# ML.GasPrise.Low.Error
source: Gas price is too low, and it should be greater than 1 Gwei.
ja: Gas価格が低いです。1gweiより高く設定してください。

# ML.GasPrise.Height.Error
source: Gas price is too high, and it should be less than 100 Gwei
ja: Gas価格が高いです。100gweiより低く設定してください。

# ML.export.backup.button.Howtotitle
source: How to back up your wallet?
ja: ウォレットをバックアップする方法

# ML.MainWallet
source: Main wallet
ja: メインウォレット

# ML.Wallet
source: Wallet
ja: ウォレット

# ML.Recive
source: Receive
ja: 承諾

# ML.Password.Forget
source: Forget password? You can reset password by inputting Mnemonic or private key.
ja: パスワードを忘れましたか？連想単語キーまたはプライベートキーを利用してパスワードをリセットすることができます。

# ML.Password.ChangeSuccess
source: Succeed in modifying the password
ja: パスワードの変更に成功！

# ML.Deleting
source: Delete
ja: 削除

# ML.Wallet.exist
source: Wallet exists, do you want to set it with new password? (Please remember the new password)
ja: 既存のウォレットがあります。パスワードをリセットしますか？（ウォレットの新しいパスワードを必ずメモしてください。）

# ML.Wallet.Sure
source: OK
ja: 確認

# ML.Transaction.cell.Sure
source: OK
ja: 確認

# ML.Send
source: Send
ja: 伝送

# ML.Approve
source: Approve
ja: 承認完了

# ML.App.Update.Tip
source: App version is updated.
ja: 新しいバージョンにアップデートされました。

# ML.App.Update.SubTitle
source: Download the updated version?
ja: 하겠습니까? 今アップデートしますか？

# ML.App.Update.Go
source: Yes
ja: 가기 今する

# ML.App.Update.Next
source: No
ja: 後でする

# ML.App.Update.IsNew
source: The present version is the latest one.
ja: 現在、最新バージョンであります。

# ML.App.Update.NoTips
source: No prompt.
ja: 再通知しない

# ML.Transaction.time.label.title
source: Transaction time
ja: 取引時間

# ML.Transaction.cell.error.title
source: Error
ja: エラー

# ML.Transaction.cell.received.title
source: Received
ja: 受領完了

# ML.Transaction.cell.receiving.title
source: Receiving
ja: 受領中

# ML.Transaction.cell.sending.title
source: Sending
ja: 伝送中

# ML.Transaction.cell.sent.title
source: Sent
ja: 伝送完了

# ML.Transaction.cell.tokenTransfer%@.title
source: Transfer %@
ja: 送金 %@

# ML.Transaction.cell.failed.title
source: Failure
ja: 失敗

# ML.Transaction.cell.pending.title
source: Waiting
ja: 待機

# ML.Transaction.cell.unknown.title
source: Unknown
ja: 不明

# ML.Loading
source: Loading
ja: ロード中

# ML.Export.warning.private.key
source: Export at your own risk.
ja: プライベートキーをインポートによる発生するすべての結果はユーザーが責任を負う。

# ML.Export.warningTwo.private.key
source: Anyone who has private key can visit your wallet
ja: プライベートキーを所持した任意の者が私のウォレットを訪問することができる。

# ML.Lanuch.Page1.Title
source: Self-control of property
ja: 私の財産を管理・統制

# ML.Lanuch.Page2.Title
source: Point-point free transaction
ja: ノード間の自由送金

# ML.Lanuch.Page3.Button
source: Open Maylol wallet
ja: ビズロールのウォレット作成

# ML.Lanuch.Page1.detail
source: Block chain wallet ensures everyone’s interest Private key is property, please make double backup
ja: チェーン・ウォレットはすべてのユーザーに権利を付与する。 プライベートキーは資産と同じようなものなので、必ず二重のバックアップを行ってください。

# ML.Lanuch.Page2.detail
source: No need for third party agency Connect both ends of the earth in a minute
ja: 제3의 중개 업자가 필요 없다. 第三の仲介業者が要らない。 거리에 구애 받지 않고 모든 거래는 순식간에 완료 할 수 있다. 距離に関係なく、すべての取引は瞬時に完了できる。

# confirmPayment.from.label.title
source: From
vi: Từ

# confirmPayment.to.label.title
source: To
vi: Đến

# export.noBackup.label.title
source: No backup, no %@.
vi: Không sao lưu, không %@ .

source: OK
vi: Đồng ý

source: Keystore JSON
vi: Keystore dạng JSON

# transaction.cell.unknown.title
source: Unknown
vi: Không xác định

source: Chain ID
vi: ID chuỗi

# transaction.from.label.title
source: From
vi: Từ

# transaction.to.label.title
source: To
vi: Đến

# confirmPayment.dapp.label.title
source: DApp
vi: Ứng dụng phân tán

source: Powered By
vi: Được hỗ trợ bởi

# settings.about.title
source: About
vi: Thông tin thêm
