Repository: MAYLOL/maylol-wallet-ios
Catalog: Trust/Localization/*.lproj/Localizable.strings
Languages: ja, vi

source: Advanced
ja: 発展
vi: Nâng cao

# app.device.jailbreak.description
source: Any 'jailbreak' app can access Trust's keychain data and steal your wallet! Wipe this wallet immediately and restore on a secure device.
ja: すべての脱獄アプリは Trust のキーチェーンのデータにアクセスし、あなたのウォレットを盗むことができます！このウォレットをすぐに取り除き、安全なデバイスに戻してください。
vi: Bất kỳ ứng dụng 'jailbreak' nào cũng có thể truy cập dữ liệu chuỗi khóa của Trust và ăn cắp ví của bạn! Xóa ví tiền này và khôi phục lại trên một thiết bị khác an toàn hơn.

# app.device.jailbreak.title
source: DEVICE SECURITY COMPROMISED
ja: デバイスのセキュリティが損なわれます
vi: BẢO MẬT THIẾT BỊ ĐÃ BỊ XÂM PHẠM

source: Cancel
ja: キャンセル
vi: Hủy bỏ

# configureTransaction.error.gasFeeTooHigh
source: Gas Fee too high. Max available: %@
ja: ガス手数料が高すぎます。利用可能な最大値: %@
vi: Phí Gas quá cao. Chỉ có sẵn tối đa: %@

# configureTransaction.error.gasLimitTooHigh
source: Gas Limit too high. Max available: %li
ja: ガスリミットが高すぎます。利用可能な最大値： %li
vi: Giới hạn GAS quá cao. Chỉ có sẵn tối đa: %d

# configureTransaction.gasLimit.label.description
source: The gas limit prevents smart contracts from consuming all your %@. We will try to calculate the gas limit automatically for you, but some smart contracts may require a custom gas limit.
ja: ガスリミットは、スマートコントラクトががあなたの全ての%@ を消費するのを防いでくれます。ガスリミットはがTrustが自動で計算しますが、一部のスマートコントラクトはガスリミットを変更する必要があります。
vi: Giới hạn GAS ngăn chặn các hợp đồng thông minh sử dụng tất cả %@ của bạn . Chúng tôi sẽ cố gắng tính toán giới hạn GAS tự động cho bạn, nhưng một số hợp đồng thông minh có thể yêu cầu một giới hạn GAS tùy chỉnh.

# configureTransaction.gasLimit.label.title
source: Gas Limit
ja: ガスリミット
vi: Giới hạn GAS

# configureTransaction.gasPrice.label.description
source: With a higher gas price, your transaction fee will be more expensive, but the %@ network will process your transaction faster.
ja: より高いガス価格で、あなたの取引手数料はより高価になりますが、 %@ネットワークはあなたのトランザクションをより速く処理します。
vi: Giá GAS càng cao, phí giao dịch của bạn sẽ cao hơn, nhưng giao dịch của bạn sẽ được sẽ được xử lý bởi mạng lưới %@ nhanh hơn.

# configureTransaction.gasPrice.label.title
source: Gas Price
ja: ガス価格
vi: Giá Gas

# configureTransaction.totalNetworkFee.label.title
source: Total network fee
ja: 総ネットワーク手数料
vi: Tổng chi phí cho mạng lưới.

# confirmPayment.confirm.button.title
source: Confirm
ja: 承認
vi: Xác nhận

# confirmPayment.gasFee.label.title
source: Network Fee
ja: ネットワーク手数料
vi: Chi phí cho mạng lưới

# confirmPayment.gasLimit.label.title
source: Gas Limit
ja: ガスリミット
vi: Giới hạn phí giao dịch (GAS)

# confirmPayment.gasPrice.label.title
source: Gas Price
ja: ガス価格
vi: Phí giao dịch (Gas)

source: Copy
ja: コピー
vi: Sao chép

# deposit.buy.button.changelly.title
source: via Changelly
ja: Changelly 経由で
vi: qua Changelly

# deposit.buy.button.coinbase.title
source: via Coinbase
ja: Coinbase経由で
vi: qua Coinbase

# deposit.buy.button.shapeShift.title
source: via ShapeShift (Crypto only)
ja: ShapeShift経由（暗号通貨のみ）
vi: qua ShapeShift (Chỉ có Crypto)

# deposit.buy.label.title
source: How would you like to buy?
ja: どの手段で購入しますか？
vi: Bạn muốn mua như thế nào?

source: Empty
ja: 空白
vi: Trống

# emptyView.noTokens.label.title
source: You haven't received any tokens yet!
ja: あなたはまだトークンを受け取っていません！
vi: Bạn chưa nhận được bất kỳ đồng tiền mã hóa nào!

# errorView.description.label.title
source: Something went wrong... Try again.
ja: 何か誤りがあります...もう一度やり直してください。
vi: Đã xảy ra lỗi ... Hãy thử lại.

# export.backup.button.title
source: Backup Wallet
ja: ウォレットのバックアップ
vi: Sao Lưu Ví

# export.controlYourMoney.label.title
source: Since only you control your money, you'll need to save your backup keystore in case this app is deleted.
ja: あなたのお金をコントロールできるのはあなたのみ。このアプリが削除された場合、または端末を紛失した場合に備えてウォレットをバックアップする必要があります。
vi: Vì chỉ có bạn kiểm soát tiền của bạn, bạn cần phải lưu Keystore từng ví của bạn để khôi phục lại trong trường hợp ứng dụng này bị xóa.

# export.enterCurrentPassword.textField.title
source: Enter current password to export your wallet
ja: 現在のパスワードを入力してウォレットをエクスポートする
vi: Nhập mật khẩu hiện tại để xuất ví của bạn

# export.enterPassword.textField.title
source: Enter password to encrypt your wallet
ja: ウォレットを暗号化するためのパスワードを入力してください
vi: Nhập mật khẩu để mã hóa ví của bạn

# export.neverStored.label.title
source: Your wallet is never saved to cloud storage or standard device backups.
ja: あなたのウォレットは、決してクラウドストレージまたは標準デバイスのバックアップに保存されません。
vi: Ví của bạn sẽ không bao giờ được chúng tôi lưu lên đám mây hay các thiết bị sao lưu tiêu chuẩn.

# export.presentBackupOptions.label.title
source: Preparing backup options...
ja: バックアップオプションの準備中...
vi: Đang chuẩn bị tùy chọn sao lưu ...

# export.skip.button.title
source: Do it later
ja: 後で行う
vi: Làm điều đó sau

# importWallet.importingIndicator.label.title
source: Importing wallet...
ja: ウォレットをインポート中…
vi: Đang nhập ví ...

source: Loading
ja: 読み込み中
vi: Đang nạp

source: Next
ja: 次へ
vi: Tiếp theo

source: Password
ja: パスワード
vi: Mật khẩu

source: Refresh
ja: リフレッシュ
vi: Làm mới

# request.addressCopied.title
source: Address copied
ja: アドレスをコピーしました
vi: Đã sao chép địa chỉ

# request.copyWallet.button.title
source: Copy wallet address
ja: ウォレットのアドレスをコピーする
vi: Sao chép địa chỉ ví

# request.myAddressIs.label.title
source: My %1$@ address is: %2$@
ja: 私の%1$@アドレスは： %2$@
vi: %1$@ của tôi có địa chỉ là: %2$@

# request.myPublicaddress.label.title
source: My Public %@ wallet address
ja: 自分の公開%@ウォレットアドレス
vi: Địa chỉ ví công cộng của tôi %@

source: Retry
ja: 再試行
vi: Thử lại

source: Send
ja: 送信する
vi: Gửi

# send.amount.textField.placeholder
source: Amount
ja: 数量
vi: Số lượng

# send.error.emptyClipBoard
source: Empty ClipBoard
ja: 空のクリップボード
vi: Bộ nhớ đệm trống.

# send.error.invalidAddress
source: Invalid Address
ja: 無効なアドレス
vi: Địa chỉ không hợp lệ

# send.error.wrongInput
source: Wrong Input
ja: 誤った入力
vi: Sai đầu vào

# send.max.button.title
source: Max
ja: 最大
vi: Tối đa

# send.paste.button.title
source: Paste
ja: 貼り付け
vi: Dán

# send.recipientAddress.textField.placeholder
source: Recipient Address
ja: 受信者アドレス
vi: Địa chỉ người nhận

# settings.biometricsDisabled.label.title
source: Passcode
ja: パスコード
vi: Mã khóa

# settings.biometricsEnabled.label.title
source: Passcode / %@
ja: パスコード / %@
vi: Mã khóa / %@

# settings.community.label.title
source: Community
ja: コミュニティ
vi: Cộng đồng

# settings.donate.button.title
source: Donate
ja: 寄付する
vi: Quyên góp

# settings.emailUs.button.title
source: Email Us
ja: Eメールを送る
vi: Email cho chúng tôi

# settings.error.failedToSendEmail
source: Failed to send email. Make sure you have Mail app installed.
ja: メールを送信できませんでした。 メールアプリがインストールされていることを確認してください。
vi: Thất bại trong việc gửi email. Đảm bảo rằng bạn có ứng dụng Mail được cài đặt.

# settings.feedback.email.title
source: Trust Feedback
ja: Trust フィードバック
vi: Phản hồi tới Trust

# settings.navigation.title
source: Settings
ja: 設定
vi: Cài đặt

# settings.network.button.title
source: Network
ja: ネットワーク
vi: Mạng lưới

# settings.openSourceDevelopment.label.title
source: Open Source Development
ja: オープンソース開発
vi: Phát triển nguồn mở

# settings.privacyPolicy.button.title
source: Privacy Policy
ja: 個人情報保護方針
vi: Chính sách bảo mật

# settings.pushNotifications.button.title
source: Push Notifications
ja: プッシュ通知
vi: Các thông báo đẩy

# settings.rateUsAppStore.button.title
source: Rate Us on App Store
ja: App Storeで評価してください
vi: Đánh giá chúng tôi trên App Store

# settings.reportBug.button.title
source: Report a Bug
ja: バグを報告
vi: Báo cáo lỗi

# settings.security.label.title
source: Security
ja: セキュリティ
vi: Bảo vệ

# settings.sourceCode.button.title
source: Source Code
ja: ソースコード
vi: Mã nguồn

# settings.support.label.title
source: Support
ja: サポート
vi: Hỗ trợ

# settings.termsOfService.button.title
source: Terms of Service
ja: 利用規約
vi: Các điều khoản dịch vụ

# settings.version.label.title
source: Version
ja: バージョン
vi: Phiên bản

# transactions.deposit.button.title
source: Buy
ja: 購入
vi: Mua

# transactions.myAddress.button.title
source: My Address
ja: 自分のアドレス
vi: Địa chỉ ví của tôi

# transactions.noTransactions.label.title
source: No Transactions Yet!
ja: まだトランザクションはありません！
vi: Không có giao dịch!

# wallet.navigation.title
source: Wallet
ja: ウォレット
vi: Ví tiền

# wallets.backup.alertSheet.title
source: Backup Keystore
ja: Keystore のバックアップ
vi: Sao lưu Keystore

# welcome.createWallet.button.title
source: CREATE WALLET
ja: ウォレットの作成
vi: TẠO VÍ

# welcome.erc20.label.description
source: Support for ERC20 tokens by default.
ja: ERC20トークンを標準サポートしています。
vi: Mặc định hỗ trợ cho các đồng tiền mã hóa theo chuẩn ERC20.

# welcome.erc20.label.title
source: ERC20 Compatible
ja: ERC20 対応
vi: Tương thích ERC20

# welcome.fullyTransparent.label.description
source: Code is open sourced (GPL-3.0 license) and fully audited.
ja: コードはオープンソース（GPL-3.0ライセンス）であり、完全に監査されています。
vi: Mã nguồn mở có nguồn gốc (giấy phép GPL-3.0) và được kiểm tra đầy đủ.

# welcome.fullyTransparent.label.title
source: Fully transparent
ja: 完全な透明性
vi: Hoàn toàn minh bạch

# welcome.importWallet.button.title
source: IMPORT WALLET
ja: ウォレットのインポート
vi: NHẬP VÍ VÀO

# welcome.privateAndSecure.label.description
source: Private keys never leave your device.
ja: 秘密鍵がデバイスから離れることはありません。
vi: Khóa cá nhân không bao giờ rời khỏi thiết bị của bạn.

# welcome.privateAndSecure.label.title
source: Private & Secure
ja: プライベート＆セキュア
vi: Riêng tư và An toàn

# welcome.ultraReliable.label.description
source: The fastest Ethereum wallet experience on mobile
ja: モバイルで最も速いイーサリアムウォレット体験を
vi: Trải nghiệm ví tiền Ethereum nhanh nhất trên thiết bị di động

# welcome.ultraReliable.label.title
source: Ultra Reliable
ja: 非常に高い信頼性
vi: Rất đáng tin cậy

# tokens.navigation.title
source: Tokens
ja: トークン
vi: Tiền mã hóa

# tokens.tabbar.item.title
source: Tokens
ja: トークン
vi: Tiền mã hóa

# transactions.tabbar.item.title
source: Transactions
ja: トランザクション
vi: Các giao dịch

# import.navigation.title
source: Import Wallet
ja: ウォレットをインポート
vi: Nhập vào ví

# browser.tabbar.item.title
source: Browser
ja: ブラウザ
vi: Trình duyệt

# configureTransaction.data.label.title
source: Transaction Data (Optional)
ja: トランザクションデータ（任意）
vi: Dữ liệu về giao dịch (Tùy chọn)

# confirmPayment.data.label.title
source: Data
ja: データ
vi: Dữ liệu

source: Contract Address
ja: コントラクトアドレス
vi: Địa chỉ hợp đồng

source: Copy Address
ja: アドレスをコピー
vi: Sao chép địa chỉ

source: Decimals
ja: ケタ数(Decimals)
vi: Số thập phân

# editTokens.searchBar.placeholder.title
source: Search tokens
ja: トークンの検索
vi: Tìm kiếm các đồng tiền mã hóa

# importWallet.import.alertSheet.title
source: Import Wallet Options
ja: ウォレットオプションのインポート
vi: Các tùy chọn khi nhập ví

# importWallet.import.button.title
source: Import
ja: インポート
vi: Nhập vào

# loading.dots
source: Loading %@
ja: 読み込み中%@
vi: Đang tải %@

source: More Details
ja: より詳しく
vi: Thêm các chi tiết

source: Private Key
ja: 秘密鍵
vi: Khóa cá nhân

# settings.currency.all.label.title
source: All
ja: 全て
vi: Tất cả

# settings.currency.button.title
source: Currency
ja: 通貨
vi: Tiền tệ

# settings.currency.popular.label.title
source: Popular
ja: 人気
vi: Phổ biến

# settings.network.test.label.title
source: Test
ja: テスト
vi: Kiểm tra

source: Symbol
ja: シンボル
vi: Ký hiệu

source: Today
ja: 本日
vi: Hôm nay

source: Tokens
ja: トークン
vi: Các đồng tiền mã hóa

# tokens.footer.label.title
source: Tokens will appear automagically. Tap + to add manually.
ja: トークンは自動的に表示されます。手動で追加するには + をタップします。
vi: Tiền mã hóa sẽ xuất hiện tự động. Bấm + để thêm bằng tay.

# tokens.newtoken.navigation.title
source: Add Custom Token
ja: カスタムトークンの追加
vi: Thêm đồng tiền mã hóa tùy chỉnh.

# transaction.cell.error.title
source: Error
ja: エラー
vi: Lỗi

# transaction.cell.received.title
source: Received
ja: 受信しました
vi: Đã nhận

# transaction.cell.receiving.title
source: Receiving
ja: 受信中
vi: Đang nhận

# transaction.cell.sending.title
source: Sending
ja: 送信中
vi: Đang gửi

# transaction.cell.sent.title
source: Sent
ja: 送信済み
vi: Đã gửi

# transaction.cell.tokenTransfer.title
source: Transfer %@
ja: 転送%@
vi: Chuyển khoản %@

source: Yesterday
ja: 昨日
vi: Hôm qua

source: Deleting
ja: 削除
vi: Đang xóa

source: Ethereum Address
ja: イーサリアムアドレス
vi: Địa chỉ Ethereum

# InCoordinatorError.onlyWatchAccount
source: This wallet can be only used for watching. Import Private Key/Keystore to sign transactions/messages
ja: このウォレットは監視にのみ利用できます。トランザクション／メッセージに署名するため秘密鍵/Keystoreをインポートしてください
vi: Ví này có thể chỉ được sử dụng để xem. Nhập Private Key/Keystore để xác nhận thực hiện các giao dịch.

source: Share With Friends
ja: 友だちにシェアする
vi: Chia sẻ với bạn bè.

# welldone.description.label.text
source: Help us grow by sharing this app with your friends!
ja: このアプリの発展のため、お友達にシェアしていただけませんか？
vi: Giúp chúng tôi lớn mạnh bằng cách chia sẻ ứng dụng này với bạn bè của bạn.

# welldone.navigation.title
source: Thank you!
ja: ありがとうございます！
vi: Cám ơn!

# welldone.viewmodel.sharing.text1
source: Here is the app I use to store my ETH and ERC20 tokens.
ja: これは私がETHとERC20トークンを保存するために使用するアプリです。
vi: Đây là ứng dụng tôi dùng để quản lý ETH và các loại tiền mã hóa tương thích chuẩn ERC20

# welldone.viewmodel.sharing.text2
source: Check out Trust - the wallet that lets me securely store my Ethereum and ERC20 tokens.
ja: ぜひTrustを使ってみてください。イーサリアムとERC20トークンを安全に保管できるウォレットです。
vi: Khám phá Trust - Một ví cho phép lưu trữ an toàn Ethereum và các loại tiền tương thích với ERC20.

# welldone.viewmodel.sharing.text3
source: I securely store Ethereum and ERC20 tokens in the Trust wallet
ja: イーサリアムとERC20トークンをTrust Walletに安全に保管します
vi: Ethereum và các loại tiền mã hóa tương thích ERC20 của tôi được quản lý an toàn bởi ví Trust.

# welldone.viewmodel.sharing.text4
source: I secure my Ethereum and ERC20 tokens in the Trust wallet.
ja: 私はTrust wallet で、イーサリアムとERC20トークンを保護します。
vi: Tôi quản lý Ethereum và các loại tiền mã hóa tương thích ERC20 bằng ví Trust.

# browser.home.button.title
source: Home
ja: ホーム
vi: Trang chủ

# browser.reload.button.title
source: Reload
ja: 再読み込み
vi: Tải lại

# configureTransaction.gasPriceGwei.label.title
source: Gas Price (Gwei)
ja: ガス価格（Gwei）
vi: Phí giao dịch (Gwei)

# enterPassword.confirmPassword.textField.placeholder
source: Confirm Password
ja: パスワードを認証する
vi: Xác nhận mật khẩu

# enterPassword.navigation.title
source: Backup Password
ja: バックアップパスワード
vi: Mật khẩu mã hóa khóa dự phòng.

# enterPassword.password.header.placeholder
source: Password used to encrypt your backup file to keep it secure!
ja: セキュリティのためバックアップファイルを暗号化するパスワード
vi: Mật khẩu được sử dụng để mã hóa và giữ an toàn khóa dự phòng của bạn!

# enterPassword.password.textField.placeholder
source: Password
ja: パスワード
vi: Mật khẩu

# lock.create.passcode.view.model.confirm
source: Please re-enter your passcode
ja: パスコードを再入力してください
vi: Nhập lại mã khóa của bạn

# lock.create.passcode.view.model.initial
source: Enter a new passcode
ja: 新しいパスコードを入力してください
vi: Nhập mã khóa mới

# lock.create.passcode.view.model.title
source: Set Passcode
ja: パスコードを設定する
vi: Đặt mã khóa

# lock.enter.passcode.view.model.incorrect.passcode
source: Incorrect passcode. You have %li attempts left.
ja: パスコードが間違っています。残り%li回試行できます。
vi: Mật mã không chính xác. Bạn còn %d lần thử.

# lock.enter.passcode.view.model.initial
source: Enter your passcode.
ja: パスコードを入力してください。
vi: Nhập mã khóa của bạn.

# lock.enter.passcode.view.model.touch.id
source: Logging in with Touch ID
ja: Touch IDでログイン
vi: Đăng nhập bằng Vân tay

# lock.enter.passcode.view.model.try.after.one.minute
source: Try after 1 minute.
ja: 1分後に試してください。
vi: Thử lại sau 1 phút.

source: Name
ja: 名称
vi: Tên

# send.action.copy.transaction.title
source: Copy Transaction ID
ja: トランザクション ID をコピー
vi: Sao chép ID giao dịch

# settings.emailUsReadFAQ.button.title
source: Email Us (Read FAQ first)
ja: メールで問い合わせる(よくある質問をまずお読みください)
vi: Gửi Email cho chúng tôi (hãy đọc FAQ trước)

# settings.faq.button.title
source: FAQ
ja: よくある質問
vi: Câu hỏi thường gặp

# transaction.cell.failed.title
source: Failed
ja: 失敗
vi: Thất bại

# transaction.cell.pending.title
source: Pending
ja: 保留中
vi: Đang chờ xử lý

# transactions.receive.button.title
source: Receive
ja: 受信する
vi: Nhận

# accounts.confirm.delete.message
source: Make sure you have backup of your wallet.
ja: このウォレットのバックアップがあることを確認してください。
vi: Hãy đảm bảo rằng bạn đã sao lưu ví của bạn.

# accounts.confirm.delete.title
source: Are you sure you would like to delete this wallet?
ja: このウォレットを削除してもよろしいですか？
vi: Bạn có chắc chắn muốn xóa ví này?

source: Approve
ja: 承認
vi: Chấp thuận

source: Endpoint
ja: エンドポイント
vi: Điểm cuối

# send.error.invalidAmount
source: Invalid Amount
ja: 無効な数量
vi: Số lượng không hợp lệ

# settings.customNetwork.navigation.title
source: Custom Network
ja: カスタムネットワーク
vi: Tuỳ chỉnh về Mạng lưới

# settings.network.custom.label.title
source: Custom
ja: カスタム
vi: Tuỳ chỉnh

# transaction.blockNumber.label.title
source: Block #
ja: ブロック #
vi: Khối #

# transaction.confirmation.label.title
source: Confirmation
ja: 承認
vi: Xác nhận

# transaction.id.label.title
source: Transaction #
ja: トランザクション #
vi: Giao dịch #

# transaction.time.label.title
source: Transaction time
ja: トランザクション時間
vi: Thời gian giao dịch

# settings.allowPushNotifications.button.title
source: Allow Push Notifications
ja: プッシュ通知を許可する
vi: Cho phép gửi các thông báo

# settings.pushNotifications.allowPushNotifications.footer
source: You will be notified for sent and received transactions.
ja: トランザクションの送受信が通知されます。
vi: Bạn sẽ được thông báo khi có các giao dịch Gửi hoặc Nhận.

# settings.pushNotifications.payment.button.title
source: Sent and Receive
ja: 送信と受信
vi: Gửi và nhận

# settings.pushNotifications.title
source: Push Notifications
ja: プッシュ通知
vi: Các thông báo

# bookmarks.noBookmarks.label.title
source: No bookmarks yet!
ja: まだブックマークはありません！
vi: Chưa đánh dấu!

# browser.addbookmark.button.title
source: Add Bookmark
ja: ブックマークを追加
vi: Thêm dấu trang

# browser.bookmarks.button.title
source: Bookmarks
ja: ブックマーク
vi: Dấu trang

# browser.bookmarks.confirm.delete.title
source: Are you sure you would like to delete this bookmark?
ja: このブックマークを削除しますか？
vi: Bạn có chắc chắn muốn xóa dấu trang này?

# browser.bookmarks.title
source: Bookmarks
ja: ブックマーク
vi: Đánh dấu

# browser.url.textfield.placeholder
source: Search or enter website url
ja: 検索またはウェブサイトのURLを入力する
vi: Tìm kiếm hoặc nhập vào địa chỉ trang web

source: Collectibles
ja: コレクション
vi: Bộ sưu tập

# confirmPayment.maxTotal.label.title
source: Max Total
ja: 最大合計
vi: Tổng số tối đa

source: Delete
ja: 削除
vi: Xóa bỏ

source: Edit
ja: 編集
vi: Chỉnh sửa

# emptyView.noNonTokens.label.title
source: No Collectibles Found
ja: コレクターアイテムがありません
vi: Không tìm thấy sưu tập

# enterPassword.passwordNoMatch.error
source: Passwords don't match!
ja: パスワードが一致しません！
vi: Mật khẩu không khớp

# export.noKPrivateKey.label.title
source: No Private Key for wallet
ja: ウォレットのプライベートキーがありません
vi: Ví không có khóa cá nhân

# export.privateKey.navigation.title
source: Export Private Key
ja: 秘密鍵のエクスポート
vi: Xuất khóa cá nhân

# export.qrCode.loading.label
source: Generating QR Code
ja: QRコードを生成しています
vi: Đang tạo mã QR

# export.warning.private.key
source: Export at your own risk!
ja: 自身の責任でエクスポートしてください！
vi: Bạn phải tự chịu rủi ro khi xuất ví!

# export.warningTwo.private.key
source: Anyone with your Private Key will have FULL access to your wallet!
ja: あなたの秘密鍵を持っている人なら誰でもあなたのウォレットに完全にアクセスできます！
vi: Bất kỳ ai có Khóa cá nhân của bạn đều có toàn quyền truy cập vào ví của bạn

# import.wallet.mnemonic.placeholder
source: Words separated by a space. (Usually contains 12 words)
ja: スペースで区切られた単語。 （通常は12語を含む）
vi: Các từ được phân cách bởi một khoảng trắng. (Thường có 12 từ)

# import.wallet.watch.placeholder
source: %@ Address
ja: %@アドレス
vi: Địa chỉ %@

# settings.joinCommunity.label.title
source: Join Community
ja: コミュニティに参加する
vi: Tham gia cộng đồng

# settings.support.title
source: Support
ja: サポート
vi: Hỗ trợ

# tokens.token.edit.navigation.title
source: Edit Custom Token
ja: カスタムトークンの編集
vi: Thêm đồng tiền mã hóa tùy chỉnh.

# wallet.section.hdWallet.title
source: HD Wallet
ja: HDウォレット
vi: Ví HD

# wallets.export.alertSheet.title
source: Export Private Key
ja: 秘密鍵のエクスポート
vi: Xuất khóa cá nhân

source: Share
ja: シェアする
vi: Chia sẻ

# collectibles.discover.label.title
source: Explore on OpenSea.io
ja: OpenSea.ioで探す
vi: Mở bằng OpenSea.io

# configureTransaction.error.gasFeeHigh
source: Gas Fee is too high. Max available: %1$@ %2$@
ja: ガス手数料が高すぎます。利用可能な最大値%1$@ %2$@
vi: Phí Gas quá cao. Giới hạn tối đa: %1$@ %2$@

# sent.transaction.message
source: Wait for the transaction to be mined on the network to see details.
ja: ネットワーク上でトランザクションが承認されるまで、詳細の表示をお待ちください。
vi: Chờ giao dịch được khai thác trên mạng để xem chi tiết.

# sent.transaction.title
source: Transaction Sent!
ja: トランザクションが送信されました！
vi: Giao dịch đã được thực hiện

# settings.network.test.warnning.dont.show.again
source: Don't show again
ja: 再度表示しない
vi: Không hiển thị lại

# settings.network.test.warnning.message
source: You are switching to a test network where transactions are for testing purpose only
ja: トランザクションがテスト目的のみのテストネットワークに切り替えようとしています。
vi: Bạn đang chuyển sang mạng thử nghiệm, nơi các giao dịch chỉ dành cho mục đích thử nghiệm

# settings.network.test.warnning.title
source: Warning
ja: 警告
vi: Cảnh báo

source: Disable
ja: 非表示
vi: Vô hiệu hóa

source: Wallets
ja: ウォレット
vi: Ví

# browser.qrCode.button.title
source: QR Code scan
ja: QRリーダー
vi: Trình đọc QR

# nft.details.external.button.title
source: Open on OpenSea.io
ja: OpenSea.ioで開く
vi: Mở tại địa chỉ OpenSea.io

# nft.details.internal.button.title
source: Open on %@
ja: %@で開く
vi: Mở %@

source: Bookmarks
ja: ブックマーク
vi: Các dấu trang

source: History
ja: 履歴
vi: Lịch sử

# history.noHistory.label.title
source: No history yet!
ja: まだ履歴はありません！
vi: Chưa có lịch sử nào!

source: New
ja: 最新
vi: Mới

# configureTransaction.dataField.label.title
source: Data (Optional). %@
ja: データ(任意)。 %@
vi: Dữ liệu (tùy chọn). %@

source: Nonce
ja: Nonce(ナンス)
vi: Mã giao dịch

# transaction.recipient.label.title
source: Recipient
ja: 受信者
vi: Người nhận

# transaction.sender.label.title
source: Sender
ja: 送信者
vi: Người gửi

source: Are you sure you would like to delete?
ja: 本当に削除してもよろしいですか？
vi: Bạn có chắc chắn muốn xóa không?

# confirmPayment.amount.label.title
source: Amount
ja: 数量
vi: Số lượng

source: Incoming Transaction
ja: 受信中のトランザクション
vi: Giao dịch gửi đến

source: Outgoing Transaction
ja: 送信中のトランザクション
vi: Giao dịch gửi đi

source: Pending Transaction
ja: 保留中のトランザクション
vi: Giao dịch đang thực hiện

# settings.browser.clearCache.alert.message
source: This will clear cache, cookies, and other browsing data.
ja: これにより、キャッシュ、Cookie、およびその他の閲覧データが消去されます。
vi: Thao tác này sẽ xóa bộ nhớ đệm, cookie và các dữ liệu duyệt web khác.

# settings.browser.clearCache.alert.title
source: Clear Browsing Data?
ja: 閲覧データを消去しますか？
vi: Xóa dữ liệu duyệt web?

# settings.browser.clearCache.title
source: Clear Browser Cache
ja: ブラウザキャッシュを消去する
vi: Xóa bộ nhớ đệm của trình duyệt

# settings.browser.searchEngine.title
source: Search Engine
ja: 検索エンジン
vi: Công cụ tìm kiếm

# settings.browser.title
source: DApp Browser
ja: DApp ブラウザ
vi: Trình duyệt phân tán

# transaction.deployContract.label.title
source: Deploy smart contract
ja: スマートコントラクトをデプロイする
vi: Triển khai hợp đồng thông minh

# import.keystore.footer
source: Several lines of text beginning with “{...}” plus the password you used to encrypt it
ja: 「 {...} 」で始まる複数行のテキスト。あなたが入力したパスワードによって中身が暗号化されます。
vi: Một số dòng văn bản bắt đầu bằng “ {...} ” thêm mật khẩu bạn đã sử dụng để mã hóa nó

# import.mnemonic.footer
source: Typically 12 (sometimes 24) words separated by single spaces
ja: 通常、単一のスペースで区切られた12（時には24）個の単語
vi: Thường có 12 (đôi khi 24) từ đơn được phân tách bằng dấu cách

# import.privateKey.footer
source: Typically 64 alphanumeric characters
ja: 通常64文字の英数字
vi: Thường có 64 ký tự chữ và số
